// Підключаємо технологію express для back-end сервера
const express = require('express')
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router()

// ================================================================
class Purchase {}

// ===================================================
router.get('/', function (req, res) {
  // res.render генерує нам HTML сторінку

  // ↙️ cюди вводимо назву файлу з сontainer
  res.render('index-purchase', {
    // вказуємо назву папки контейнера, в якій знаходяться наші стилі
    style: 'index',
    data: {},
  })
  // ↑↑ сюди вводимо JSON дані
})

// ================================================================
// ===================================================
router.get('/alert', function (req, res) {
  // res.render генерує нам HTML сторінку

  // ↙️ cюди вводимо назву файлу з сontainer
  res.render('alert-p', {
    // вказуємо назву папки контейнера, в якій знаходяться наші стилі
    style: 'alert-p',
    info: 'Щось вилізло',
    date: Date(),
    id: 22,
    data: {},
  })
  // ↑↑ сюди вводимо JSON дані
})

// ================================================================

// Підключаємо роутер до бек-енду
module.exports = router
